---
title: ApplicationException
classe: Autodesk.Revit.Exceptions.ApplicationException
namespace: Autodesk.Revit.Exceptions
eredita: System.Exception
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# ApplicationException

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FunctionId FunctionId { get; }` | `applicationException.FunctionId` | FunctionId |
| `Void GetObjectData(SerializationInfo, StreamingContext)` | `applicationException.GetObjectData(info, context)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```